## ineuron Assessment Test-2

## SVM Regressor

In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

In [40]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt

from sklearn.model_selection import train_test_split
from sklearn.svm import SVR
from sklearn.preprocessing import StandardScaler, MinMaxScaler

from sklearn.metrics import mean_squared_error

In [3]:
data = pd.read_csv("Bengaluru_House_Data.csv")

## EDA - Explorative Data Analysis

In [5]:
data.head()
data.tail(3)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.0
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.0
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,NaN,550,1.0,1.0,17.0

In [10]:
data.shape
# there are 13,320 observations and 9 variables.

(13320, 9)

In [12]:
data.columns

Index(['area_type', 'availability', 'location', 'size', 'society',
       'total_sqft', 'bath', 'balcony', 'price'],
      dtype='object')

first 8 variables are independent variables. 
PRICE is the dependant variable, for which we have to do predictions    

The independant variables are:   
'area_type', 'availability', 'location', 'size', 'society',  'total_sqft', 'bath', 'balcony'    

Dependant variable is  
'price'

In [8]:
data.info()
# we see that in some varibales there are missing values, 
# society variable has many missing values about 58%, we can drop it. here, i hav enot dropped it
# for other varibales with missing values, we can impute missing values uisng techniques like KNN imputer, mean or median

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   area_type     13320 non-null  object
 1   availability  13320 non-null  object
 2   location      13319 non-null  object
 3   size          13304 non-null  object
 4   society       7818 non-null   object
 5   total_sqft    13320 non-null  object
 6   bath          13247 non-null  float64
 7   balcony       12711 non-null  float64
 8   price         13320 non-null  float64
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [42]:
7818/13320

0.5869369369369369

In [9]:
data.describe()

               bath       balcony         price
count  13247.000000  12711.000000  13320.000000
mean       2.692610      1.584376    112.565627
std        1.341458      0.817263    148.971674
min        1.000000      0.000000      8.000000
25%        2.000000      1.000000     50.000000
50%        2.000000      2.000000     72.000000
75%        3.000000      2.000000    120.000000
max       40.000000      3.000000   3600.000000

In [ ]:
#  'area_type', 'availability', 'location', 'size', 'society', 'total_sqft', 'bath', 'balcony'

In [17]:
data.area_type.value_counts()

area_type
Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: count, dtype: int64

In [19]:
data.availability.value_counts()

availability
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
15-Aug               1
17-Jan               1
16-Nov               1
16-Jan               1
14-Jul               1
Name: count, Length: 81, dtype: int64

In [20]:
data.location.value_counts()

location
Whitefield                        540
Sarjapur  Road                    399
Electronic City                   302
Kanakpura Road                    273
Thanisandra                       234
                                 ...
Bapuji Layout                       1
1st Stage Radha Krishna Layout      1
BEML Layout 5th stage               1
singapura paradise                  1
Abshot Layout                       1
Name: count, Length: 1305, dtype: int64

In [41]:
data.size.value_counts()

AttributeError: 'numpy.int32' object has no attribute 'value_counts'

In [22]:
data.society.value_counts()

society
GrrvaGr    80
PrarePa    76
Sryalan    59
Prtates    59
GMown E    56
           ..
Amionce     1
JaghtDe     1
Jauraht     1
Brity U     1
RSntsAp     1
Name: count, Length: 2688, dtype: int64

In [26]:
data.balcony.value_counts()
# for balcony, we can impute using 2, since many have 2 balconies

balcony
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: count, dtype: int64

In [25]:
data.bath.value_counts()

bath
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
40.0       1
15.0       1
14.0       1
18.0       1
Name: count, dtype: int64

In [29]:
data.head(3)

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00

In [32]:
X = data.drop("price", axis=1)
X.head(2)

,area_type,availability,location,size,society,total_sqft,bath,balcony
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0

In [33]:
y = data['price']
y

0         39.07
1        120.00
2         62.00
3         95.00
4         51.00
          ...
13315    231.00
13316    400.00
13317     60.00
13318    488.00
13319     17.00
Name: price, Length: 13320, dtype: float64

### Splitting the dataset

In [35]:
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size=0.2, random_state=123)
X_train.shape
X_test.shape
y_train.shape
y_test.shape

(10656, 8)

(2664, 8)

(10656,)

(2664,)

In [38]:
X_train.head(2)
X_test.head(2)

,area_type,availability,location,size,society,total_sqft,bath,balcony
313,Super built-up Area,Ready To Move,Kanakpura Road,3 BHK,JRrnauv,1550,3.0,3.0
11962,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,3 BHK,NaN,1021,3.0,2.0

,area_type,availability,location,size,society,total_sqft,bath,balcony
2388,Super built-up Area,Ready To Move,Kanakpura Road,3 BHK,Wiowsri,1480,2.0,2.0
9801,Built-up Area,18-Apr,Whitefield,3 Bedroom,Prtates,3150,3.0,1.0

all variables should be in numerical form . we have to convert string to numerical form

In [ ]:
# scaling X 
scaler = StandardScaler()
X_train = scaler.fit_transform(X_train)
X_test = scaler.transform(X_test)

### Fitting the model and Making Predictions

In [ ]:
svreg = SVR() 
svreg.fit(X_train, y_train)
train_pred = svreg.predict(X_train)
test_pred = svreg.predict(X_test)

### Check Accuracy -  MSE - mean squared error
we can check accuracy of our model using MSE

In [ ]:
# this tests the MSE for training data
mean_squared_error(y_train, train_pred)

# this tests the MSE for test data
mean_squared_error(y_test, test_pred)